УТ_для_edt/src/InformationRegisters/CRM_ВидыКонтактнойИнформацииМессенджеров/CRM_ВидыКонтактнойИнформацииМессенджеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>CRM_ВидыКонтактнойИнформацииМессенджеров</name>
  <attributes>
    <name>ВидКИ_Клиент</name>
    <type>
      <types>CatalogRef.ВидыКонтактнойИнформации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидКИ_КЛ</name>
    <type>
      <types>CatalogRef.ВидыКонтактнойИнформации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидКИ_ПК</name>
    <type>
      <types>CatalogRef.ВидыКонтактнойИнформации</types>
    </type>
  </attributes>
  <dimensions>
    <name>ТипМессенджера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <comment>АПК:413 - №744.2.1.1 Допустимо не отключать историю выбора, так как она используется, а переопределение отбора фиксированное, то есть служебные и недействительные пользователи в нее не попадут, но если как-то попали, то это не является проблемой</comment>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.Подразделение</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>DefinedType.ФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подготовлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяСервиса</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>СвойстваПользователяИБ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ДолжностнаяПозиция</name>
    <type>
      <types>CatalogRef.CRM_ДолжностныеПозиции</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ОтписалсяОтEmailРассылок</name>
    <comment>Отписался от Email рассылок</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Планируемый</name>
    <comment>Участвует в планировании проектов</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_УчаствуетВАнкетировании</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Фотография</name>
    <comment>Фотография клиента частное лицо</comment>
    <type>
      <types>CatalogRef.ПользователиПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ЕмейлДляСинхронизации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Фотография</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_РазрешеноИзменятьКоординаты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>смартМенеджерСайта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>смартРабочаяПочта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартРабочийТелефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартВнутреннийНомерВАТС</name>
    <comment>#1352 смарт: Лопато 04.05.2023 //Звонки из 1С (через городской стационарный телефон)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартДоступныДанныеВнутреннихФизическихЛиц</name>
    <comment>#1644 смарт: Ермаков 19.04.2024 / Изменить доступ к документам физических лиц</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>смартДоступныДанныеВнешнихФизическихЛиц</name>
    <comment>#1644 смарт: Ермаков 19.04.2024 / Изменить доступ к документам физических лиц</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>смартВнутреннийНомерВАТСДополнительный</name>
    <comment>//++ #Б-6744 смарт: Фролов 28.05.2026 //Перехват заявок. Загрузка звонков в 1С с нескольких мобильных менеджеров</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>сфпВремяЗадержкиНабораДобавочногоНомера</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>CRM_ДополнительнаяИнформация</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.CRM_ДополнительнаяИнформация</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.CRM_ДополнительнаяИнформация</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРегистрации</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>смартОповещениеОбИнтересах</name>
    <comment>//++ #Б-3560 смарт: Фролов 01.07.2025 //Создания механизма настройки оповещений о событиях с Интересами. </comment>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Новые</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Квалификация</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Завершенные</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Оборудование</name>
      <comment>//++ #Б-3858 смарт: Фролов 18.07.2025 //Расширение настройки отправки оповещений о обработке Интересов.</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Запчасти</name>
      <comment>//++ #Б-3858 смарт: Фролов 18.07.2025 //Расширение настройки отправки оповещений о обработке Интересов.</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>РасходныеМатериалы</name>
      <comment>//++ #Б-3858 смарт: Фролов 18.07.2025 //Расширение настройки отправки оповещений о обработке Интересов.</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Прочее</name>
      <comment>//++ #Б-3858 смарт: Фролов 18.07.2025 //Расширение настройки отправки оповещений о обработке Интересов.</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектОповещения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>смартКонтролируемыеМенеджеры</name>
    <comment>//++ #Б-7838 смарт: Фролов 12.08.2026 //Уведомления для Беловой Т.</comment>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt/src/CommonModules/CRM_РаботаСМессенджерамиСерверПовтИсп/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// CRM работа с мессенджерами сервер повт исп
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область ОбщиеПроцедурыИФункции

// Функция - Найти контакт по контактной информации
//
// Параметры:
//  ИДПользователя	 - Строка - ID Пользователя.
//  УчетнаяЗапись	 - СправочникСсылка.CRM_УчетныеЗаписиМессенджеров - Учетная запись.
//  ТипКИ			 - ПеречислениеСсылка.ТипыКонтактнойИнформации	 - Тип контактной информации.
// 
// Возвращаемое значение:
//  СправочникСсылка.ВидыКонтактнойИнформации - Найденный контакт.
//
Функция НайтиКонтактПоКонтактнойИнформации(ИДПользователя, УчетнаяЗапись, ТипКИ) Экспорт

	СоответствиеКонтактов = Новый Соответствие;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Контакты.Ссылка,
	|	Контакты.ИДПользователя КАК ИДПользователя,
	|	Контакты.Порядок КАК Порядок
	|ИЗ
	|	(ВЫБРАТЬ
	|		КонтактнаяИнформация.Ссылка КАК Ссылка,
	|		КонтактнаяИнформация.Представление КАК ИДПользователя,
	|		9 КАК Порядок
	|	ИЗ
	|		Справочник.Пользователи.КонтактнаяИнформация КАК КонтактнаяИнформация
	|	ГДЕ
	|		КонтактнаяИнформация.Представление = &ИДПользователя
	|		И КонтактнаяИнформация.Тип = &Тип
	|		И НЕ(КонтактнаяИнформация.Ссылка.ПометкаУдаления)
	|";
	
	МассивОписанияТиповКонтактов = ВзаимодействияКлиентСервер.ОписанияКонтактов();
	Для каждого ЭлементМассиваОписания Из МассивОписанияТиповКонтактов Цикл
		
		Если ЭлементМассиваОписания.Имя = "Пользователи" Тогда
			Продолжить;
		КонецЕсли;
		// +Рарус alexpr
		//Если ЭлементМассиваОписания.Тип = Тип("СправочникСсылка.CRM_ПотенциальныеКлиенты") 
		//	И Не ПолучитьФункциональнуюОпцию("CRM_ИспользоватьПотенциальныхКлиентов") Тогда
		//	Продолжить;
		//КонецЕсли;
		// -Рарус alexpr
		
		Если ЭлементМассиваОписания.Тип = Тип("СправочникСсылка.КонтактныеЛицаПартнеров") Тогда
			Порядок = "1";
		ИначеЕсли ЭлементМассиваОписания.Тип = Тип("СправочникСсылка.Партнеры") Тогда
			Порядок = "2";
		ИначеЕсли ЭлементМассиваОписания.Тип = Тип("СправочникСсылка.CRM_ПотенциальныеКлиенты") Тогда
			Порядок = "3";
		Иначе
			Порядок = "9";
		КонецЕсли;
		
		Запрос.Текст = Запрос.Текст + "
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КонтактнаяИнформация.Ссылка КАК Ссылка,
		|	КонтактнаяИнформация.Представление КАК ИДПользователя,
		|	" + Порядок + " КАК Порядок
		|ИЗ
		|	Справочник." + ЭлементМассиваОписания.Имя + ".КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация.Представление = &ИДПользователя
		|	И КонтактнаяИнформация.Тип = &Тип
		|	И (НЕ КонтактнаяИнформация.Ссылка.ПометкаУдаления)
		|";
		
	КонецЦикла;	
	
	Запрос.Текст = Запрос.Текст + ") КАК Контакты
	|УПОРЯДОЧИТЬ ПО
	|	Порядок
	|ИТОГИ ПО
	|	ИДПользователя";

	Если ТипКИ = Перечисления.ТипыКонтактнойИнформации.Телефон Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "КонтактнаяИнформация.Представление = &ИДПользователя",
												"КонтактнаяИнформация.НомерТелефона = &ИДПользователя");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ИДПользователя", ИДПользователя);
	Запрос.УстановитьПараметр("Тип", ТипКИ);
	
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока Выборка.Следующий() Цикл
		ВыборкаПоСсылкам = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Если (ВыборкаПоСсылкам.Следующий()) Тогда
			Возврат ВыборкаПоСсылкам.Ссылка;
		КонецЕсли;
	КонецЦикла;

	Возврат Неопределено;

КонецФункции

// Получить вид контактной информации мессенджера
//
// Параметры:
//  ТипМессенджера	 - Строка	 - Тип мессенджера.
//  Контакт			 - СправочникСсылка	 - Тип контактного лица.
// 
// Возвращаемое значение:
//  СправочникСсылка.ВидыКонтактнойИнформации - Найденный контакт.
//
Функция ПолучитьВидКИМессенджера(Знач ТипМессенджера, Контакт) Экспорт
	
	Если ТипЗнч(ТипМессенджера) = Тип("СправочникСсылка.CRM_УчетныеЗаписиМессенджеров") Тогда
		ТипМессенджера = ТипМессенджера.ТипМессенджера;
	КонецЕсли;
	
	ВидКИ = РегистрыСведений.CRM_ВидыКонтактнойИнформацииМессенджеров.ВидКонтактнойИнформацииМессенджера(ТипМессенджера,
		 Контакт);
	Если ЗначениеЗаполнено(ВидКИ) Тогда
		Возврат ВидКИ;
	КонецЕсли;
	
	МодульМенеджера = CRM_РаботаСМессенджерамиСерверПовтИсп.МенеджерМессенджера(ТипМессенджера);
	Возврат МодульМенеджера.ПолучитьВидКИМессенджера(Контакт);
	
КонецФункции

// Тип контактной информации мессенджера
//
// Параметры:
//  УчетнаяЗапись - СправочникСсылка.CRM_УчетныеЗаписиМессенджеров - Учетная запись.
// 
// Возвращаемое значение:
//  ПеречислениеСсылка.ТипыКонтактнойИнформации - Тип контакной информации. 
//
Функция ТипКИМессенджера(УчетнаяЗапись) Экспорт
	
	ТипКИМессенджера = Перечисления.ТипыКонтактнойИнформации.ПустаяСсылка();
	
	МодульМенеджера = CRM_РаботаСМессенджерамиСерверПовтИсп.МенеджерМессенджера(УчетнаяЗапись.ТипМессенджера);
	Если НЕ МодульМенеджера = Неопределено Тогда
		ТипКИМессенджера = МодульМенеджера.ТипКИМессенджера();
	КонецЕсли;
	
	Возврат ТипКИМессенджера;
	
КонецФункции

// Возвращает структуру с параметрами доступа.
//
// Параметры:
//  УчетнаяЗапись - СправочникСсылка.CRM_УчетныеЗаписиМессенджеров - Учетная запись.
// 
// Возвращаемое значение:
//  Структура - Структура с параметрами доступа.
//
Функция СтруктураПараметровДоступа(УчетнаяЗапись) Экспорт
	ПараметрыДоступа = УчетнаяЗапись.ХранилищеПараметровДоступа.Получить();
	Если ТипЗнч(ПараметрыДоступа) = Тип("Структура")
		И Не ПараметрыДоступа.Свойство("ПараметрыПрокси") Тогда

		ПараметрыДоступа.Вставить("ПараметрыПрокси", ПараметрыПрокси(УчетнаяЗапись));
	КонецЕсли;
	Возврат ПараметрыДоступа;
КонецФункции

// Возвращает параметры работы мессенджера.
//
// Параметры:
//  УчетнаяЗапись - СправочникСсылка.CRM_УчетныеЗаписиМессенджеров - Учетная запись.
// 
// Возвращаемое значение:
//  Структура - Структура с параметрами.
//
Функция ПараметрыМессенджера(УчетнаяЗапись) Экспорт
	
	МодульМенеджера = CRM_РаботаСМессенджерамиСерверПовтИсп.МенеджерМессенджера(УчетнаяЗапись.ТипМессенджера);
	Возврат МодульМенеджера.ПараметрыМессенджера();

КонецФункции

// Возвращает параметры работы мессенджера по умолчанию.
//
// Возвращаемое значение:
//  Структура - Структура с параметрами.
//
Функция СтруктураПараметровМессенджера() Экспорт
	
    ПараметрыМессенджера = Новый Структура();
	
	ПараметрыМессенджера.Вставить("ИспользуютсяВложения", Истина);
	ПараметрыМессенджера.Вставить("ТекстОтдельноОтВложений", Ложь);
	ПараметрыМессенджера.Вставить("ФильтрВложений", "");
	ПараметрыМессенджера.Вставить("МаксРазмерВложения", 0);
	
	Возврат ПараметрыМессенджера;

КонецФункции

// Функция - Начало адреса страницы пользователя
//
// Параметры:
//  УчетнаяЗапись - СправочникСсылка.CRM_УчетныеЗаписиМессенджеров - Учетная запись.
// 
// Возвращаемое значение:
//  Строка - Строка с адресом страницы.
//
Функция НачалоАдресаСтраницыПользователя(УчетнаяЗапись) Экспорт
	МодульМенеджера = CRM_РаботаСМессенджерамиСерверПовтИсп.МенеджерМессенджера(УчетнаяЗапись.ТипМессенджера);
	Возврат МодульМенеджера.НачалоАдресаСтраницыПользователя();
КонецФункции

// Функция - Начало адреса страницы пользователя
//
// Параметры:
//  УчетнаяЗапись 	- СправочникСсылка.CRM_УчетныеЗаписиМессенджеров - Учетная запись.
//	ID_Пользователя - Строка - Идентификатор пользователя.  
// 
// Возвращаемое значение:
//  Строка - Строка с адресом страницы.
//
Функция ПредставлениеКонтактнойИнформацииПользователя(УчетнаяЗапись, ID_Пользователя) Экспорт
	
	ПредставлениеКИПользователя = "";
	
	МодульМенеджера = CRM_РаботаСМессенджерамиСерверПовтИсп.МенеджерМессенджера(УчетнаяЗапись.ТипМессенджера);
	Если НЕ МодульМенеджера = Неопределено Тогда
		ПредставлениеКИПользователя = МодульМенеджера.ПредставлениеКонтактнойИнформацииПользователя(ID_Пользователя);
	КонецЕсли;
	
	Возврат ПредставлениеКИПользователя;
	
КонецФункции

// Возвращает признак возможности изменения сообщений.
//
// Параметры:
//	УчетнаяЗапись - СправочникСсылка.CRM_УчетныеЗаписиМессенджеров - Учетная запись.
// 
// Возвращаемое значение:
//  Булево - признак возможности изменения сообщений.
//
Функция ВозможноИзменениеСообщений(УчетнаяЗапись) Экспорт
	МодульМенеджера = CRM_РаботаСМессенджерамиСерверПовтИсп.МенеджерМессенджера(УчетнаяЗапись.ТипМессенджера);
	Возврат МодульМенеджера.ВозможноИзменениеСообщений();
КонецФункции

// Возвращает признак использования вложений.
//
// Параметры:
//	УчетнаяЗапись - СправочникСсылка.CRM_УчетныеЗаписиМессенджеров - Учетная запись.
// 
// Возвращаемое значение:
//  Булево - признак использования вложений.
//
Функция ИспользуютсяВложения(УчетнаяЗапись) Экспорт
	МодульМенеджера = CRM_РаботаСМессенджерамиСерверПовтИсп.МенеджерМессенджера(УчетнаяЗапись.ТипМессенджера);
	Возврат МодульМенеджера.ИспользуютсяВложения();
КонецФункции

// Возвращает HTML-текст контекста.
//
// Параметры:
//	УчетнаяЗапись  - СправочникСсылка.CRM_УчетныеЗаписиМессенджеров - Учетная запись.
//	idПользователя - Строка - Идентификатор пользователя.
//	idГруппы	   - Строка - Идентификатор группы.
// 
// Возвращаемое значение:
//  Строка - HTML-текст контекста.
//
Функция HTMLКонтекста(УчетнаяЗапись, idПользователя, idГруппы) Экспорт
	МодульМенеджера = CRM_РаботаСМессенджерамиСерверПовтИсп.МенеджерМессенджера(УчетнаяЗапись.ТипМессенджера);
	Контекст = МодульМенеджера.HTMLКонтекста(УчетнаяЗапись, idПользователя, idГруппы);
	Возврат ?(ЗначениеЗаполнено(Контекст), Контекст, ""); 
КонецФункции

// Возвращает тип MIME по расширению файла.
//
// Параметры:
//	Расширение - Строка - Расширение файла.
// 
// Возвращаемое значение:
//  Строка - тип MIME по расширению файла.
//
Функция ТипMIMEПоРасширениюФайла(Расширение) Экспорт
	
	ТипыMIME = ТипыMIME();
	
	Тип = ТипыMIME.Получить(НРег(Расширение));
	Если Тип = Неопределено Тогда
		Тип = "application/octet-stream";
	КонецЕсли;
	Возврат Тип;
	
КонецФункции

// Возвращает расширение по типу MIME.
//
// Параметры:
//	Тип - Строка - Тип MIME.
// 
// Возвращаемое значение:
//  Строка - расширение файла.
//
Функция РасширениеПоТипуMIME(Тип) Экспорт
	
	ТипыMIME = ТипыMIME();
	
	Для каждого КлючЗначение Из ТипыMIME Цикл
		Если СтрНайти(НРег(Тип), НРег(КлючЗначение.Значение)) <> 0 Тогда
			Возврат КлючЗначение.Ключ;
		КонецЕсли;
	КонецЦикла;
	
КонецФункции

// Функция возвращает соответствие типов MIME
// 
// Возвращаемое значение:
//   - Соответствие
//
Функция ТипыMIME() Экспорт
	
	ТипыMIME = Новый Соответствие;
	
	ТипыMIME.Вставить("aac", "audio/aac");
	ТипыMIME.Вставить("abw", "application/x-abiword");
	ТипыMIME.Вставить("arc", "application/octet-stream");
	ТипыMIME.Вставить("avi", "video/x-msvideo");
	ТипыMIME.Вставить("azw", "application/vnd.amazon.ebook");
	ТипыMIME.Вставить("bin", "application/octet-stream");
	ТипыMIME.Вставить("bz", "application/x-bzip");
	ТипыMIME.Вставить("bz2", "application/x-bzip2");
	ТипыMIME.Вставить("csh", "application/x-csh");
	ТипыMIME.Вставить("css", "text/css");
	ТипыMIME.Вставить("csv", "text/csv");
	ТипыMIME.Вставить("doc", "application/msword");
	ТипыMIME.Вставить("eot", "application/vnd.ms-fontobject");
	ТипыMIME.Вставить("epub", "application/epub+zip");
	ТипыMIME.Вставить("gif", "image/gif");
	ТипыMIME.Вставить("htm", "text/html");
	ТипыMIME.Вставить("html", "text/html");
	ТипыMIME.Вставить("ico", "image/x-icon");
	ТипыMIME.Вставить("ics", "text/calendar");
	ТипыMIME.Вставить("jar", "application/java-archive");
	ТипыMIME.Вставить("jpeg", "image/jpeg");
	ТипыMIME.Вставить("jpg", "image/jpeg");
	ТипыMIME.Вставить("js", "application/javascript");
	ТипыMIME.Вставить("json", "application/json");
	ТипыMIME.Вставить("mid", "audio/midi");
	ТипыMIME.Вставить("midi", "audio/midi");
	ТипыMIME.Вставить("mp3", "audio/mpeg");
	ТипыMIME.Вставить("mpeg", "video/mpeg");
	ТипыMIME.Вставить("mpkg", "application/vnd.apple.installer+xml");
	ТипыMIME.Вставить("odp", "application/vnd.oasis.opendocument.presentation");
	ТипыMIME.Вставить("ods", "application/vnd.oasis.opendocument.spreadsheet");
	ТипыMIME.Вставить("odt", "application/vnd.oasis.opendocument.text");
	ТипыMIME.Вставить("oga", "audio/ogg");
	ТипыMIME.Вставить("ogv", "video/ogg");
	ТипыMIME.Вставить("ogx", "application/ogg");
	ТипыMIME.Вставить("otf", "font/otf");
	ТипыMIME.Вставить("png", "image/png");
	ТипыMIME.Вставить("pdf", "application/pdf");
	ТипыMIME.Вставить("ppt", "application/vnd.ms-powerpoint");
	ТипыMIME.Вставить("rar", "application/x-rar-compressed");
	ТипыMIME.Вставить("rtf", "application/rtf");
	ТипыMIME.Вставить("sh", "application/x-sh");
	ТипыMIME.Вставить("svg", "image/svg+xml");
	ТипыMIME.Вставить("swf", "application/x-shockwave-flash");
	ТипыMIME.Вставить("tar", "application/x-tar");
	ТипыMIME.Вставить("tif", "image/tiff");
	ТипыMIME.Вставить("tiff", "image/tiff");
	ТипыMIME.Вставить("ts", "video/vnd.dlna.mpeg-tts");
	ТипыMIME.Вставить("ttf", "font/ttf");
	ТипыMIME.Вставить("vsd", "application/vnd.visio");
	ТипыMIME.Вставить("wav", "audio/x-wav");
	ТипыMIME.Вставить("weba", "audio/webm");
	ТипыMIME.Вставить("webm", "video/webm");
	ТипыMIME.Вставить("webp", "image/webp");
	ТипыMIME.Вставить("woff", "font/woff");
	ТипыMIME.Вставить("woff2", "font/woff2");
	ТипыMIME.Вставить("xhtml", "application/xhtml+xml");
	ТипыMIME.Вставить("xls", "application/vnd.ms-excel");
	ТипыMIME.Вставить("xml", "application/xml");
	ТипыMIME.Вставить("xul", "application/vnd.mozilla.xul+xml");
	ТипыMIME.Вставить("zip", "application/zip");
	ТипыMIME.Вставить("3gp", "video/3gpp");
	ТипыMIME.Вставить("3g2", "video/3gpp2");
	ТипыMIME.Вставить("7z", "application/x-7z-compressed");
	
	Возврат ТипыMIME;
	
КонецФункции

// Получить картинку мессенджера.
//
// Параметры:
//	УчетнаяЗапись  - СправочникСсылка.CRM_УчетныеЗаписиМессенджеров - Учетная запись.
//	ИмяМакета	   - Строка - Имя макета.
// 
// Возвращаемое значение:
//  СписокЗначений - Список мессенджеров.
//
Функция КартинкаМессенджера(УчетнаяЗапись, ИмяМакета = "Иконка_16") Экспорт

	МодульМенеджера = CRM_РаботаСМессенджерамиСерверПовтИсп.МенеджерМессенджера(УчетнаяЗапись.ТипМессенджера);
	Если МодульМенеджера = Неопределено Тогда
		Возврат Новый Картинка;
	КонецЕсли;

	// Макет может отсутствовать в ИБ (частичная загрузка обработки без BinaryData-макетов).
	ИмяОбработки = "CRM_РаботаСМессенджером" + Строка(УчетнаяЗапись.ТипМессенджера);
	МетаданныеОбработки = Метаданные.Обработки.Найти(ИмяОбработки);
	Если МетаданныеОбработки = Неопределено
		Или МетаданныеОбработки.Макеты.Найти(ИмяМакета) = Неопределено Тогда
		Возврат Новый Картинка;
	КонецЕсли;

	Попытка
		ДанныеКартинки = МодульМенеджера.ПолучитьМакет(ИмяМакета);
		Возврат Новый Картинка(ДанныеКартинки);
	Исключение
		Возврат Новый Картинка;
	КонецПопытки;

КонецФункции

// Возвращает текст заголовка.
//
// Параметры:
//	ТипМессенджера - Строка - Тип мессенджера.
// 
// Возвращаемое значение:
//  Строка - текст заголовка.
//
Функция ТекстЗаголовка(ТипМессенджера) Экспорт

	Заголовок = "{}"; // Строка в формате JSON

	МодульМенеджера = CRM_РаботаСМессенджерамиСерверПовтИсп.МенеджерМессенджера(ТипМессенджера);
	Если МодульМенеджера = Неопределено Тогда
		Возврат Заголовок;
	КонецЕсли;

	ИмяОбработки = "CRM_РаботаСМессенджером" + Строка(ТипМессенджера);
	МетаданныеОбработки = Метаданные.Обработки.Найти(ИмяОбработки);
	Если МетаданныеОбработки = Неопределено
		Или МетаданныеОбработки.Макеты.Найти("МакетФорматированнойСтроки") = Неопределено Тогда
		Возврат Заголовок;
	КонецЕсли;

	Попытка
		Макет = МодульМенеджера.ПолучитьМакет("МакетФорматированнойСтроки");
		Заголовок = Макет.ПолучитьОбласть("Заголовок").ТекущаяОбласть.Текст;
	Исключение
		Заголовок = "{}";
	КонецПопытки;

	Возврат Заголовок;

КонецФункции

// Возвращает параметры прокси сервера.
//
// Параметры:
//	УчетнаяЗапись  - СправочникСсылка.CRM_УчетныеЗаписиМессенджеров - Учетная запись.
// 
// Возвращаемое значение:
//  Структура - Структура с параметрами.
//
Функция ПараметрыПрокси(УчетнаяЗапись) Экспорт
	Если ЗначениеЗаполнено(УчетнаяЗапись.ПроксиСервер) Тогда
		СтруктураПрокси = Новый Структура("Сервер, Порт, Пользователь, Пароль",
			 УчетнаяЗапись.ПроксиСервер, УчетнаяЗапись.ПроксиПорт, УчетнаяЗапись.ПроксиПользователь,
			 УчетнаяЗапись.ПроксиПароль);
	Иначе
		СтруктураПрокси = Неопределено;
	КонецЕсли;
	Возврат СтруктураПрокси;
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращает менеджер обработки мессенджера.
//
// Параметры:
//	ТипМессенджера - Строка - Тип мессенджера.
// 
// Возвращаемое значение:
//  ОбработкаМенеджер, Неопределено - менеджер обработки мессенджера.
//
Функция МенеджерМессенджера(ТипМессенджера) Экспорт
	
	Перем МодульМенеджера;
	
	Если ЗначениеЗаполнено(ТипМессенджера) Тогда
		МодульМенеджера = Обработки["CRM_РаботаСМессенджером" + Строка(ТипМессенджера)];
	КонецЕсли;
	
	Возврат МодульМенеджера;
	
КонецФункции

#КонецОбласти
